/*
หลังจากผ่านบททดสอบแรก บททดสอบที่สองก็มาต่อทันที โดยคราวนี้นักสืบ V ต้องการตรวจสอบผู้ต้องสงสัยเพื่อเปรียบเทียบกับข้อมูลที่ได้รับมาในที่เกิดเหตุ เพื่อระบุว่าเป็นคนร้ายหรือไม่ ข้อมูลที่ต้องใช้ประกอบไปด้วย :
กรุ๊ปเลือด, ส่วนสูง, นํ้าหนัก , ค่า BMI
โดยจะต้องตรวจสอบว่าข้อมูลเหล่านี้ของผู้ต้องสงสัยว่าตรงกับข้อมูลที่มีหรือไม่

คุณซึ่งเป็นโปรแกรมเมอร์สุดเก่ง จึงลงมือเขียนโปรแกรมเพื่อทำแบบทดสอบนี้ทันที โดยนักสืบให้เงื่อนไขดังต่อไปนี้:
กรุ๊ปเลือด O
ความสูงต้องน้อยกว่า 180 cm
นํ้าหนักต้องมากกว่า 60 kg
ค่า BMI อยู่ในช่วงของ 20-25
หากข้อมูลตรงกับเงื่อนไขของผู้ต้องสงสัยรายนี้ทั้งหมด จึงสรุปได้ว่าเป็นคนร้าย
ข้อมูลนำเข้า

บรรทัดแรก : ตัวอักษร a ( a ∈ { ‘A’, ‘B’, ‘O’ } ) — กรุ๊ปเลือดของผู้ต้องสงสัย
บรรทัดที่สอง : จำนวนจริง b ( 140 ≤ b ≤ 220 ) — ส่วนสูงของผู้ต้องสงสัย
บรรทัดที่สาม : จำนวนจริง c ( 50 ≤ c ≤ 100 ) — น้ำหนักของผู้ต้องสงสัย
ผลลัพธ์

พิมพ์ “Yes” ถ้าข้อมูลที่ได้รับมาตรงตามเงื่อนไขที่กล่าว, หากไม่พิมพ์ “No”

ตัวอย่าง
ข้อมูลนำเข้า 	ผลลัพธ์
O
160
62 	          Yes

O
179
64 	          No

A
180
60            No

อธิบาย
ตัวอย่างที่ 1 ผู้ต้องสงสัยคนนี้เป็นคนร้าย เนื่องจากข้อมูลตรงเงื่อนไขทั้งหมด
ตัวอย่างที่ 2 แม้ข้อมูล 3 อย่างแรกจะตรงตามเงื่อนไข แต่ค่า BMI ไม่ตรง

สูตรคำนวณค่า BMI = ( น้ำหนัก (kg) / ส่วนสูง2 (m2) )

*/

#include <stdio.h>
#include <stdbool.h>

int main(){
    char b;
    float h, w, bmi;
    bool y = true;

    scanf("%c", &b);
    scanf("%f\n", &h);
    scanf("%f", &w);

    bmi = w / ((h / 100) * (h / 100));

    if (b != 'O'){
        y = false;
    }

    if (h >= 180.00){
        y = false;
    }

    if (w <= 60.00){
        y = false;
    }

    if (((bmi > 25) || (bmi < 20)) && !((bmi <= 25) && (bmi >= 20))){
        y = false;
    }

    if (y){
        printf("Yes");
    }
    else {
        printf("No");
    }

    return 0;
}