/*
หลังจากผ่านบททดสอบทั้งสอง คุณก็ได้กลายเป็นนักสืบฝึกหัดสักที ขณะที่คุณกำลังนั่งพักอยู่ คุณสังเกตเห็นถึงความเหนื่อยของนักสืบ V
คุณจึงเข้าไปถามว่าเป็นอะไร เขาตอบกลับมาว่า เหนื่อยเพราะต้องนั่งคำนวณอายุเฉลี่ยของคนร้ายในแต่ละเดือนเพื่อเก็บไว้เป็นสถิติ

คุณซึ่งเป็นโปรแกรมเมอร์สุดเก่ง จึงไม่ลังเลที่ช่วยเหลือนักสืบ V โดยการเขียนโปรแกรมคำนวณอายุเฉลี่ยของคนร้าย 5 คน
ข้อมูลนำเข้า

บรรทัดเดียว : จำนวนเต็ม A1 , A2 , A3 , A4 , A5 ( 16 ≤ Ai ≤ 60 ) — อายุของคนร้ายแต่ละคน
ผลลัพธ์

จำนวนจริง Aavg อายุเฉลี่ยของคนร้ายทั้ง 5 คน ( ทศนิยมความละเอียด 2 หลัก )

ตัวอย่าง
ข้อมูลนำเข้า 	ผลลัพธ์
17 23 41 39 60 	36.00
60 59 55 55 57 	57.20
*/

#include <stdio.h>

int main(){
    int a, b, c, d, e;
    scanf("%d %d %d %d %d", &a, &b , &c, &d, &e);
    float s = (a+b+c+d+e) / 5.00;
    printf("%.2f", s);
    return 0;
}