/*
ก่อนที่คุณจะได้สืบสวนในงานเลี้ยงรุ่น CPE สมัยก่อนคุณเป็นแค่ โปรแกรมเมอร์คนหนึ่ง คุณจึงอยากหาประสบการณ์เกี่ยวกับงานสืบสวน คุณจึงไปสมัครเป็นนักสืบฝึกหัด กับนักสืบชื่อดัง V
โดยนักสืบ V อยากรู้จักกับคุณก่อน โดยไม่ต้องบอกชื่อหรือข้อมูลส่วนตัว

คุณซึ่งเป็นโปรแกรมเมอร์สุดเก่ง คุณจึงต้องพิมพ์ชื่อรุ่นของตัวเอง CPE 38 ให้กับนักสืบ V

ข้อมูลนำเข้า
ไม่มี

ผลลัพธ์
บรรทัดเดียว : พิมพ์ข้อความ CPE38

ตัวอย่าง
ข้อมูลนำเข้า 	ผลลัพธ์
	         CPE38
*/

#include <stdio.h>

int main(){
    printf("CPE38\n");
    return 0;
}