/*
หลังจากนักสืบ V รู้จักกับคุณแล้ว เลยให้บททดสอบแรก
นักสืบ V ต้องการบันทึกเบาะแสของผู้ต้องสงสัย โดยผู้ต้องสงสัยมีคนเดียว ข้อมูลเกี่ยวกับผู้ต้องสงสัยมีดังนี้ : อายุ ส่วนสูง น้ำหนัก กรุ๊ปเลือด

คุณซึ่งเป็นโปรแกรมเมอร์สุดเก่ง คุณจึงจะต้องเขียนโปรแกรม ทำบททดสอบแรกนี้เพื่อพิสูจน์ตนเอง ให้นักสืบ V โดยคุณจะต้องรับข้อมูล อายุ ส่วนสูง น้ำหนัก กรุ๊ปเลือด ตามลำดับ และพิมพ์ออกมาตามตัวอย่างข้างล่าง

เช่น ข้อมูลที่คุณได้รับคือ อายุ : 18, ส่วนสูง : 175, น้ำหนัก : 65, กรุ๊ปเลือด: A
ข้อมูลที่ต้องพิมพ์ออกมา :
suspect's age : 18
suspect’s height : 175.00
suspect’s weight : 65.00
suspect’s blood group : A

*อย่าลืมเว้นวรรค และแสดงตัวเลขทศนิยมความละเอียดเพียง 2 หลัก
ข้อมูลนำเข้า

บรรทัดแรก: จำนวนเต็ม a ( 18 ≤ a ≤ 60 ) — อายุของผู้ต้องสงสัย
บรรทัดที่สอง: จำนวนจริง b ( 140 ≤ b ≤ 220 ) — ส่วนสูงของผู้ต้องสงสัย
บรรทัดที่สาม: จำนวนจริง c ( 50 ≤ c ≤ 100 ) — น้ำหนักของผู้ต้องสงสัย
บรรทัดที่สี่: ตัวอักษร d ( d ∈ { ‘A’, ‘B’, ‘O’ } ) — กรุ๊ปเลือดของผู้ต้องสงสัย
ผลลัพธ์

มีทั้งหมดสี่บรรทัด แต่ละบรรทัดพิมพ์ข้อมูลของผู้ต้องสงสัยตามลำดับ โดยมีรูปแบบการพิมพ์ตามตัวอย่าง

ตัวอย่าง
ข้อมูลนำเข้า 	ผลลัพธ์
18
175
65
A 	suspect's age : 18
suspect's height : 175.00
suspect's weight : 65.00
suspect's blood group : A
23
186
72.98
O 	suspect's age : 23
suspect's height : 186.00
suspect's weight : 72.98
suspect's blood group : O
50
205.6
89
B 	suspect's age : 50
suspect's height : 205.60
suspect's weight : 89.00
suspect's blood group : B
*/

#include <stdio.h>

int main(){
    int a;
    float b, c;
    char d;

    scanf("%d\n", &a);
    scanf("%f\n", &b);
    scanf("%f\n", &c);
    scanf("%c", &d);

    printf("suspect's age : %d\n", a);
    printf("suspect's height : %.2f\n", b);
    printf("suspect's weight : %.2f\n", c);
    printf("suspect's blood group : %c\n", d);
    return 0;
}